package ch02;

public class LongExam {

	public static void main(String[] args) {
		// Long 타입은 int 타입의 2배인 64bit값을 갖는다.
		// 대부분 금융, 은행, 증권 등 돈에 관련된 변수타입으로 사용된다.
		// 초기값 입력시 int와 차이를 주기 위해 숫자뒤에 l, L(알아보기 쉬워서 주로 쓴다.)을 붙인다.
		
		long var1 = 10 ; // int 범위에서는 L 생략가능
		long var2 = 20L ;
		long var3 = 2222222222222222222L;
		float var4 = 222222222222222222222222222222222222222F; // 실수타입 소수점사용이여서 범위가 넓다 부동소수점 방식의 값으로 저장
		double var5 = 222222222222222222222222222222222222222222222222222222222222D; //소수점을 더욱 자세가하게 하기 위해 사용
				
		

	}

}
